Конфигурация/Catalogs/ЮрФизЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ЮрФизЛица</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидЮрФизЛица</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЮрФизЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/InformationRegisters/КонтактныеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КонтактныеЛица</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОснованиеПолномочий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Языки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/РеквизитыЮридическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РеквизитыЮридическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КраткоеНаименованиеПоУставу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолноеНаименованиеПоУставу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СокращенноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПП2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганизационноПравоваяФорма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизационноПравовыеФормы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>350</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКАТО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачиОГРН</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганВыдавшийОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезидентРФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>TIN</Name>
					<Comment>Taxpayer Identification Number</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтранаРегистрации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидРегистрационногоДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДокументовЮридическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отрасль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отрасли</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МеждународнаяКомпания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособСозданияМеждународнойКомпании</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыСозданияМеждународнойКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Языки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ВнутренниеПеречни.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ВнутренниеПеречни</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПеречня</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПеречнейОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/СотрудникиОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СотрудникиОрганизации</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКадровыхСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ДолиПайщиковВИнвестиционномФонде.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ДолиПайщиковВИнвестиционномФонде</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодЗаписи</Name>
					<Comment>Дата записи в миллисекундах, для контроля последовательности проведения</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пайщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗачислениеПаев</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыЮрФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыЮрФизЛиц</Name>
			<Comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВидыКадровыхСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыКадровыхСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Прием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Catalogs/ЮрФизЛица/Ext/ManagerModule.bsl
Функция ПолучитьВидыФункциональныхРолей() Экспорт
	
	ВидыФункциональныхРолей = Новый Массив();
	
	ВидыФункциональныхРолей.Добавить("Банки");
	ВидыФункциональныхРолей.Добавить("Биржи");
	ВидыФункциональныхРолей.Добавить("БрокерскиеКомпании");
	ВидыФункциональныхРолей.Добавить("ДепозитарныеКомпании");
	ВидыФункциональныхРолей.Добавить("Организации");
	ВидыФункциональныхРолей.Добавить("УправляющиеКомпании");
	ВидыФункциональныхРолей.Добавить("Эмитенты");
	
	Возврат ВидыФункциональныхРолей;
	
КонецФункции // ПолучитьВидыФункциональныхРолей

Функция ПолучитьФункциональныеРоли(ЮрФизЛицо, ВидыФункциональныхРолей = Неопределено, ТолькоСсылки = Истина) Экспорт
	
	// сначала получим функциональные роли, включенные в соответствующую подсистему
	Если ТипЗнч(ВидыФункциональныхРолей) = Тип("Строка") Тогда
		ВидыФункциональныхРолей = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВидыФункциональныхРолей, ",", Истина);
	Иначе
		ВидыФункциональныхРолей = ПолучитьВидыФункциональныхРолей();
	КонецЕсли;
	
	ТекстЗапроса = "";
	
	Для каждого ВидФункциональнойРоли Из ВидыФункциональныхРолей Цикл
		ТекстЗапроса = ТекстЗапроса + ?(ПустаяСтрока(ТекстЗапроса), "", Символы.ПС + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС + Символы.ПС) +
			"ВЫБРАТЬ " +  ?(ПустаяСтрока(ТекстЗапроса), "РАЗРЕШЕННЫЕ", "") + "
			|	Ссылка КАК ФункциональнаяРоль,
			|	""" + СокрЛП(ВидФункциональнойРоли) + """ КАК ВидФункциональнойРоли
			|ИЗ
			|	Справочник." + СокрЛП(ВидФункциональнойРоли) + "
			|ГДЕ
			|	ЮрФизЛицо = &ЮрФизЛицо";
	КонецЦикла;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ЮрФизЛицо", ЮрФизЛицо);
	
	Если ТолькоСсылки Тогда
		ФункциональныеРоли = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФункциональнаяРоль");
		
	Иначе
		ФункциональныеРоли = Новый Массив();
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ФункциональныеРоли.Добавить(Новый Структура("ВидФункциональнойРоли, ФункциональнаяРоль", Выборка.ВидФункциональнойРоли, Выборка.ФункциональнаяРоль));
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ФункциональныеРоли;
	
КонецФункции // ПолучитьФункциональныеРоли

Функция ПолучитьФункциональнуюРольКонтактныеЛица(КонтактноеЛицо) Экспорт
	
	ФункциональныеРоли = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА КонтактныеЛица.Должность = """" ТОГДА ""Контактное лицо""
		|		ИНАЧЕ КонтактныеЛица.Должность
		|	КОНЕЦ
		|		+ "" "" + КонтактныеЛица.Объект.Наименование КАК Роль,
		|	КонтактныеЛица.Объект КАК Объект
		|ИЗ
		|	РегистрСведений.КонтактныеЛица КАК КонтактныеЛица
		|ГДЕ
		|	КонтактныеЛица.КонтактноеЛицо = &КонтактноеЛицо";
		
	Запрос.УстановитьПараметр("КонтактноеЛицо", КонтактноеЛицо);
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ФункциональныеРоли.Добавить(Выборка.Объект, Выборка.Роль);
	КонецЦикла;
	
	Возврат ФункциональныеРоли;
	
КонецФункции // ПолучитьФункциональнуюРольКонтактныеЛица
	
Функция ПолучитьФункциональнуюРоль(ЮрФизЛицо, ВидФункциональнойРоли) Экспорт

	ФункциональныеРоли = ПолучитьФункциональныеРоли(ЮрФизЛицо, ВидФункциональнойРоли);
	
	Если ФункциональныеРоли.Количество() > 0 Тогда
		Возврат ФункциональныеРоли[0];
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции // ПолучитьФункциональнуюРоль

Функция ФункциональнаяРольДоступна(ФункциональнаяРоль, ОписаниеПричиныЗапрета = "") Экспорт
	
	РольДоступна = Истина;
	
	// функциональные роли, кроме клиентов и пайщиков, могут быть только юр. лица  
	ВидФункциональнойРоли = ФункциональнаяРоль.Метаданные().Имя;
	
	Если ВРег(ВидФункциональнойРоли) <> ВРег("Клиенты") и ВРег(ВидФункциональнойРоли) <> ВРег("Пайщики") Тогда
		РольДоступна = (ФункциональнаяРоль.ЮрФизЛицо.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ЮридическоеЛицо);
	КонецЕсли;
	Если Не РольДоступна Тогда
		ОписаниеПричиныЗапрета = "«" + ФункциональнаяРоль.ЮрФизЛицо + "» не является юр. лицом";
		Возврат Ложь;
	КонецЕсли;
	
	// проверим уникальность данной роли в пределах юр./физ. лиц
	ФункциональныеРоли = ПолучитьФункциональныеРоли(ФункциональнаяРоль.ЮрФизЛицо, ВидФункциональнойРоли);
	
	Если Не ЗначениеЗаполнено(ФункциональнаяРоль.Ссылка) Тогда
		// это новая функциональная роль и аналогичных у юр./физ. лица быть не должно
		РольДоступна = (ФункциональныеРоли.Количество() = 0);
	Иначе
		// проверим, что единственная выбранная роль юр./физ. лица — это текущая
		Для Инд = 0 По ФункциональныеРоли.ВГраница() Цикл
			Если ФункциональныеРоли[Инд] <> ФункциональнаяРоль.Ссылка Тогда
				РольДоступна = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если Не РольДоступна Тогда
		ОписаниеПричиныЗапрета = "Роль «" + ФункциональнаяРоль.Метаданные().Синоним + "» уже была выбрана у юр. или физ. лица «" + ФункциональнаяРоль.ЮрФизЛицо + "»";
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // ФункциональнаяРольДоступна

Функция ЯвляетсяРезидентом(Ссылка, Организация, НаДату = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицСрезПоследних.РезидентРФ КАК РезидентРФ
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|			&НаДату,
		|			ЮрФизЛицо = &ЮрФизЛицоСсылка
		|				И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеквизитыФизическихЛицСрезПоследних.РезидентРФ
		|ИЗ
		|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|			&НаДату,
		|			ЮрФизЛицо = &ЮрФизЛицоСсылка
		|				И Организация = &Организация
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицСрезПоследних";
		
	Запрос.УстановитьПараметр("НаДату", НаДату);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ЮрФизЛицоСсылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.РезидентРФ;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Клиент")
		и Параметры.Клиент Тогда
		
		Если ВидФормы = "ФормаОбъекта" Тогда
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = "ФормаЭлементаКлиент";
		ИначеЕсли ВидФормы = "ФормаСписка" Тогда
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = "ФормаСпискаКлиентов";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЯвляетсяКлиентом(ЮрФизЛицо, Организация, НаДату = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	ПоместитьКлиентовВМенеджерВременныхТаблиц(Запрос, Организация, НаДату);
	
	Запрос.УстановитьПараметр("ЮрФизЛицо", ЮрФизЛицо);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Клиенты.ЮрФизЛицо КАК ЮрФизЛицо
		|ИЗ
		|	_Клиенты КАК _Клиенты
		|ГДЕ
		|	_Клиенты.ЮрФизЛицо = &ЮрФизЛицо";
	
	Возврат НЕ Запрос.Выполнить().Пустой();	
	
КонецФункции

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	Если РаботаСоСтрокамиКлиентСервер.ТолькоЦифрыВСтроке(Параметры.СтрокаПоиска) Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо КАК ЮрФизЛицо
		|ПОМЕСТИТЬ _ПолныйСписок
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних КАК РеквизитыЮридическихЛицСрезПоследних
		|ГДЕ
		|	РеквизитыЮридическихЛицСрезПоследних.ИНН ПОДОБНО &ИНН
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(, Организация = &Организация) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
		|ГДЕ
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ИНН ПОДОБНО &ИНН
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
		|ИЗ
		|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(, Организация = &Организация) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
		|ГДЕ
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ИНН ПОДОБНО &ИНН
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	_ПолныйСписок.ЮрФизЛицо КАК ЮрФизЛицо
		|ИЗ
		|	_ПолныйСписок КАК _ПолныйСписок";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("ИНН", Параметры.СтрокаПоиска + "%");
		Запрос.УстановитьПараметр("Организация", ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация"));
		
		Результат = Запрос.Выполнить();
		
		Если Не Результат.Пустой() Тогда
		
			Выборка = Результат.Выбрать();
			
			ДанныеВыбора = Новый СписокЗначений;
			
			Пока Выборка.Следующий() Цикл
				ДанныеВыбора.Добавить(Выборка.ЮрФизЛицо);
			КонецЦикла;
			
			СтандартнаяОбработка = Ложь;			
		
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПодготовитьДинамическийСписокФормыСпискаВыбора(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	Список   = Форма.Список;	
	
	ТекстЗапроса = "";
	
	РеквизитыФормы = Новый Структура;
	Для Каждого РеквизитФормы Из Форма.ПолучитьРеквизиты() Цикл
		Если РеквизитФормы.Имя = "ОтображатьТолькоКлиентов" ИЛИ РеквизитФормы.Имя = "СписокПеречнейВКоторыеВходитОбъект" Тогда
			РеквизитыФормы.Вставить(РеквизитФормы.Имя, РеквизитФормы);
		КонецЕсли;
	КонецЦикла;	
	
#Область ТекстЗапроса_Клиенты
	ТекстЗапроса = ПолучитьТекстаЗапросаКлиенты("_Клиенты");
	ТекстЗапроса = ТекстЗапроса + Символы.ПС + ";" + Символы.ПС;
#КонецОбласти	

#Область ТекстЗапроса_ВнутренниеПеречни

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВидыПеречнейОбъектов.ИмяПредопределенныхДанных КАК Имя,
		|	ВидыПеречнейОбъектов.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ВидыПеречнейОбъектов КАК ВидыПеречнейОбъектов
		|ГДЕ
		|	ВидыПеречнейОбъектов.Родитель = ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.ВнутренниеПеречни)
		|	И НЕ ВидыПеречнейОбъектов.ПометкаУдаления";
	
	ВидыПеречнейОбъектов = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВидыПеречнейОбъектов.Добавить(Новый Структура("Имя, Наименование", Выборка.Имя, Выборка.Наименование));
	КонецЦикла;
	
	МассивПолей = Новый Массив;

	Для Каждого ВидПеречня Из ВидыПеречнейОбъектов Цикл
		МассивПолей.Добавить(СтрШаблон("МАКСИМУМ(Перечни.ВидПеречня = ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.%1) И Перечни.Действует) КАК %1", ВидПеречня.Имя));
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + СтрШаблон(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Перечни.Объект КАК Объект,
		|	%1
		|ПОМЕСТИТЬ _ВнутренниеПеречни
		|ИЗ
		|	РегистрСведений.ВнутренниеПеречни.СрезПоследних(&Период, Организация = &Организация) КАК Перечни
		|
		|СГРУППИРОВАТЬ ПО
		|	Перечни.Объект",
		СтрСоединить(МассивПолей, "," + Символы.ПС + Символы.Таб));
		
	ТекстЗапроса = ТекстЗапроса + Символы.ПС + ";" + Символы.ПС;
		
#КонецОбласти

#Область ТекстЗапроса_Основной
		ТекстЗапроса = ТекстЗапроса + 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СправочникЮрФизЛица.Ссылка КАК Ссылка,
			|	СправочникЮрФизЛица.ПометкаУдаления КАК ПометкаУдаления,
			|	СправочникЮрФизЛица.Родитель КАК Родитель,
			|	СправочникЮрФизЛица.ЭтоГруппа КАК ЭтоГруппа,
			|	СправочникЮрФизЛица.Код КАК Код,
			|	СправочникЮрФизЛица.Наименование КАК Наименование,
			|	СправочникЮрФизЛица.ВидЮрФизЛица КАК ВидЮрФизЛица,
			|	СвязанныеЮридическиеЛицаСрезПоследних.РодительскоеЮридическоеЛицо КАК ГоловнаяОрганизация,
			|	СправочникЮрФизЛица.Комментарий КАК Комментарий,
			|	СправочникЮрФизЛица.Предопределенный КАК Предопределенный,
			|	СправочникЮрФизЛица.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
			|	ВЫБОР
			|		КОГДА СправочникЮрФизЛица.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ЮридическоеЛицо)
			|			ТОГДА РеквизитыЮридическихЛицСрезПоследних.ИНН
			|		КОГДА СправочникЮрФизЛица.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
			|			ТОГДА РеквизитыФизическихЛицАнкетныеСрезПоследних.ИНН
			|	КОНЕЦ КАК ИННГруппаКомпаний,
			|	ВЫБОР
			|		КОГДА СправочникЮрФизЛица.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ЮридическоеЛицо)
			|			ТОГДА РеквизитыЮридическихЛицАнкетныеСрезПоследних.ИНН
			|		КОГДА СправочникЮрФизЛица.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
			|			ТОГДА РеквизитыФизическихЛицАнкетныеСрезПоследних.ИНН
			|	КОНЕЦ КАК ИННАнкета,
			|	ВЫБОР
			|		КОГДА СправочникЮрФизЛица.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ЮридическоеЛицо)
			|			ТОГДА РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу
			|		КОГДА СправочникЮрФизЛица.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
			|			ТОГДА РеквизитыФизическихЛицАнкетныеСрезПоследних.Фамилия + "" "" + РеквизитыФизическихЛицАнкетныеСрезПоследних.Имя + "" "" + РеквизитыФизическихЛицАнкетныеСрезПоследних.Отчество
			|	КОНЕЦ КАК ПолноеНаименованиеГруппаКомпаний,
			|	ВЫБОР
			|		КОГДА СправочникЮрФизЛица.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ЮридическоеЛицо)
			|			ТОГДА РеквизитыЮридическихЛицАнкетныеСрезПоследних.ПолноеНаименованиеПоУставу
			|		КОГДА СправочникЮрФизЛица.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
			|			ТОГДА РеквизитыФизическихЛицАнкетныеСрезПоследних.Фамилия + "" "" + РеквизитыФизическихЛицАнкетныеСрезПоследних.Имя + "" "" + РеквизитыФизическихЛицАнкетныеСрезПоследних.Отчество
			|	КОНЕЦ КАК ПолноеНаименованиеАнкета,
			|	ВЫБОР
			|		КОГДА СправочникЮрФизЛица.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ЮридическоеЛицо)
			|			ТОГДА РеквизитыЮридическихЛицАнкетныеСрезПоследних.Период
			|		КОГДА СправочникЮрФизЛица.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
			|			ТОГДА РеквизитыФизическихЛицАнкетныеСрезПоследних.Период
			|	КОНЕЦ КАК ДатаАнкеты,
			|	_Клиенты.ЮрФизЛицо ЕСТЬ НЕ NULL  КАК Клиент,
			|	СотрудникиОрганизации.ЮрФизЛицо ЕСТЬ НЕ NULL  КАК СотрудникОрганизации,
			|	_ВнутренниеПеречни.*
			|ИЗ
			|	Справочник.ЮрФизЛица КАК СправочникЮрФизЛица
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ВнутренниеПеречни КАК _ВнутренниеПеречни
			|		ПО СправочникЮрФизЛица.Ссылка = _ВнутренниеПеречни.Объект
			|		ЛЕВОЕ СОЕДИНЕНИЕ _Клиенты КАК _Клиенты
			|		ПО СправочникЮрФизЛица.Ссылка = _Клиенты.ЮрФизЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
			|				&Период,
			|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
			|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
			|		ПО СправочникЮрФизЛица.Ссылка = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
			|				&Период,
			|				Организация = &Организация
			|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
			|		ПО СправочникЮрФизЛица.Ссылка = РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
			|				&Период,
			|				Организация = &Организация
			|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
			|		ПО СправочникЮрФизЛица.Ссылка = РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязанныеЮридическиеЛица.СрезПоследних(&Период, ТипСвязи = ЗНАЧЕНИЕ(Справочник.ТипыСвязейЮрФизЛиц.ГоловнаяОрганизация)) КАК СвязанныеЮридическиеЛицаСрезПоследних
			|		ПО СправочникЮрФизЛица.Ссылка = СвязанныеЮридическиеЛицаСрезПоследних.ЮридическоеЛицо
			|			И (СвязанныеЮридическиеЛицаСрезПоследних.Действует)
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			|			СотрудникиОрганизацииСрезПоследних.Сотрудник.ЮрФизЛицо КАК ЮрФизЛицо
			|		ИЗ
			|			РегистрСведений.СотрудникиОрганизации.СрезПоследних(&Период, Организация = &Организация) КАК СотрудникиОрганизацииСрезПоследних
			|		ГДЕ
			|			СотрудникиОрганизацииСрезПоследних.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)) КАК СотрудникиОрганизации
			|		ПО СправочникЮрФизЛица.Ссылка = СотрудникиОрганизации.ЮрФизЛицо
			|ГДЕ
			|	(&ОтборСотрудники = ЛОЖЬ
			|			ИЛИ СотрудникиОрганизации.ЮрФизЛицо ЕСТЬ НЕ NULL )
			|	И (&ОтображатьТолькоКлиентов = ЛОЖЬ
			|			ИЛИ _Клиенты.ЮрФизЛицо ЕСТЬ НЕ NULL )";
	
	Если РеквизитыФормы.Свойство("СписокПеречнейВКоторыеВходитОбъект") Тогда
		ТекстЗапроса = ТекстЗапроса + " 
			|	И (&ТолькоВходящиеВПеречни = ЛОЖЬ
			|		ИЛИ СправочникЮрФизЛица.ВидЮрФизЛица В (&СписокПеречней)
			|		ИЛИ (СотрудникиОрганизации.ЮрФизЛицо ЕСТЬ НЕ NULL И ""Сотрудники"" В (&СписокПеречней))
			|		ИЛИ СправочникЮрФизЛица.Ссылка В
			|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|				ВнутренниеПеречниСрезПоследних.Объект КАК ЮрФизЛицо
			|			ИЗ
			|				РегистрСведений.ВнутренниеПеречни.СрезПоследних(&Период, Организация = &Организация
			|					И ВидПеречня В (&СписокПеречней)) КАК ВнутренниеПеречниСрезПоследних
			|			ГДЕ
			|				ВнутренниеПеречниСрезПоследних.Действует))";
	КонецЕсли;	
	
	Для Каждого ВидПеречня Из ВидыПеречнейОбъектов Цикл
		ТекстЗапроса = ТекстЗапроса + СтрШаблон(" 
			|	И (&Отбор%1 = ЛОЖЬ ИЛИ _ВнутренниеПеречни.%1 = ИСТИНА)", ВидПеречня.Имя); 					
	КонецЦикла;
	
	Список.ТекстЗапроса = ТекстЗапроса;
	
#КонецОбласти
	

#Область ДобавитьПоляВСписок

	Для Каждого ВидПеречня Из ВидыПеречнейОбъектов Цикл
		НовыйЭлемент = Элементы.Добавить(ВидПеречня.Имя, Тип("ПолеФормы"), Элементы.ГруппаВнутренниеПеречни);
		НовыйЭлемент.ПутьКДанным = "Список." + ВидПеречня.Имя;
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	КонецЦикла;

#КонецОбласти

#Область ДобавитьОтборыНаФорму

	ДобавляемыеРеквизиты = Новый Массив();
	
	Для Каждого ВидПеречня Из ВидыПеречнейОбъектов Цикл
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Отбор" + ВидПеречня.Имя, Новый ОписаниеТипов("Булево"),, ВидПеречня.Наименование));
	КонецЦикла;
	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Для Каждого ВидПеречня Из ВидыПеречнейОбъектов Цикл
		НовыйЭлемент = Элементы.Добавить("Отбор" + ВидПеречня.Имя, Тип("ПолеФормы"), Элементы.ГруппаВнутренниеПеречниОтборы);
		НовыйЭлемент.ПутьКДанным = "Отбор" + ВидПеречня.Имя;
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
		НовыйЭлемент.УстановитьДействие("ПриИзменении", "ОтборВнутренниеПеречниПриИзменении_Подключаемый"); 
	КонецЦикла;
	
#КонецОбласти

#Область УстановитьПараметрыСписка
	
	Форма.Список.УстановитьОграниченияИспользованияВОтборе(СтрРазделить("Сотрудник", ",")); //Сотрудник из вложенного запроса не должен попадать в отборы
	
	Для Каждого Элемент Из Форма.Элементы.ГруппаВнутренниеПеречниОтборы.ПодчиненныеЭлементы Цикл
		Если Форма.Элементы.КомандаВнутренниеПеречни.Пометка Тогда
			Форма.Список.Параметры.УстановитьЗначениеПараметра(Элемент.Имя, Форма[Элемент.Имя]);
		Иначе
			Форма.Список.Параметры.УстановитьЗначениеПараметра(Элемент.Имя, Ложь);
		КонецЕсли;
	КонецЦикла;

	Список.Параметры.УстановитьЗначениеПараметра("Организация", 			 ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация"));
	Список.Параметры.УстановитьЗначениеПараметра("Период",					 Форма.Период);
	Список.Параметры.УстановитьЗначениеПараметра("ОтображатьТолькоКлиентов", ?(РеквизитыФормы.Свойство("ОтображатьТолькоКлиентов"), Форма.ОтображатьТолькоКлиентов, Ложь));
	
#КонецОбласти
	
КонецПроцедуры

Процедура ПоместитьКлиентовВМенеджерВременныхТаблиц(ИсточникВременныхТаблиц, Организация, Период, ИмяВременнойТаблицы = "_Клиенты") Экспорт
	
	МенеджерВременныхТаблиц = СистемныеФункции.МенеджерВременныхТаблицИзИсточникаВременныхТаблиц(ИсточникВременныхТаблиц);

	Если МенеджерВременныхТаблиц.Таблицы.Найти(ИмяВременнойТаблицы) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация", Организация);	
	Запрос.УстановитьПараметр("Период",		 Период);	

	Запрос.Текст = ПолучитьТекстаЗапросаКлиенты(ИмяВременнойТаблицы);
	
	Запрос.Выполнить();
	
КонецПроцедуры

Функция ПолучитьТекстаЗапросаКлиенты(ИмяВременнойТаблицы)
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДолиПайщиковВИнвестиционномФондеОстатки.Пайщик КАК ЮрФизЛицо,
		|	ДолиПайщиковВИнвестиционномФондеОстатки.Организация КАК Организация
		|ПОМЕСТИТЬ _ИмяВременнойТаблицы
		|ИЗ
		|	РегистрНакопления.ДолиПайщиковВИнвестиционномФонде.Остатки(&Период, Организация = &Организация) КАК ДолиПайщиковВИнвестиционномФондеОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, Организация = &Организация) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ПО ДолиПайщиковВИнвестиционномФондеОстатки.ПаевойИнвестиционныйФонд = КлиентыДоверительногоУправленияСрезПоследних.Клиент
		|			И ДолиПайщиковВИнвестиционномФондеОстатки.Организация = КлиентыДоверительногоУправленияСрезПоследних.Организация
		|			И (КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ДатаРасторжения >= &Период)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЗаявкаПайщика.Пайщик,
		|	ЗаявкаПайщика.Организация
		|ИЗ
		|	Документ.ЗаявкаПайщика КАК ЗаявкаПайщика
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, Организация = &Организация) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ПО ЗаявкаПайщика.ПаевойИнвестиционныйФонд = КлиентыДоверительногоУправленияСрезПоследних.Клиент
		|			И ЗаявкаПайщика.Организация = КлиентыДоверительногоУправленияСрезПоследних.Организация
		|			И (КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ДатаРасторжения > &Период)
		|ГДЕ
		|	ЗаявкаПайщика.Организация = &Организация
		|	И ЗаявкаПайщика.Многократная = ИСТИНА
		|	И НЕ ЗаявкаПайщика.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент,
		|	КлиентыДоверительногоУправленияСрезПоследних.Организация
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И (СчетДоверительногоУправления.ДатаРасторжения > &Период
		|					ИЛИ СчетДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1))) КАК КлиентыДоверительногоУправленияСрезПоследних
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(КлиентыДоверительногоУправленияСрезПоследних.Клиент) = ТИП(Справочник.ЮрФизЛица)";	

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "_ИмяВременнойТаблицы", ИмяВременнойТаблицы);

	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьПоследнююАнкетуЮрФизЛица(ЮрФизЛицо, Организация, НаДату = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("ЮрФизЛицо",		ЮрФизЛицо);
	Запрос.УстановитьПараметр("Период",			НаДату);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Регистратор КАК Ссылка,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Период КАК Дата
		|ИЗ
		|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И ЮрФизЛицо = &ЮрФизЛицо
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.Регистратор,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.Период
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И ЮрФизЛицо = &ЮрФизЛицо
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		РеквизитыАнкеты = Новый Структура;
		
		Для Каждого Колонка Из Выборка.Владелец().Колонки Цикл
			РеквизитыАнкеты.Вставить(Колонка.Имя, Выборка[Колонка.Имя]);
		КонецЦикла;
		
		Возврат РеквизитыАнкеты;
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьВидыКлиентскихРолей() Экспорт
	
	ВидыКлиентскихРолей = Новый Массив();
	
	ВидыКлиентскихРолей.Добавить("Клиент ИДУ");
	ВидыКлиентскихРолей.Добавить("Клиент ИИС");
	ВидыКлиентскихРолей.Добавить("Владелец паев");
	ВидыКлиентскихРолей.Добавить("Представитель юр лица по Уставу");
	ВидыКлиентскихРолей.Добавить("Представитель юр лица по Доверенности");
	ВидыКлиентскихРолей.Добавить("Бенефициарный владелец");
	ВидыКлиентскихРолей.Добавить("Выгодоприобретатель");
	ВидыКлиентскихРолей.Добавить("Наследник");
	
	Возврат ВидыКлиентскихРолей;
	
КонецФункции // ПолучитьВидыКлиентскихРолей
